app/Leave.php

select * from `leaves` where `user_id` = '1' and `tag_id` in ('1', '2', '3', '4', '5') order by `id` desc limit 25 offset 0
select count(*) as aggregate from `leaves` where `tag_id` in ('1', '3') and `start_time` = '2017-08-31' and `end_time` = '2017-08-31'
---
    public function search($where = [])
    {

        $query = $this->OrderedBy()->getLeavesByUserId()->getStaticByTagId();

        foreach ($where as $key => $value) {

            if (Schema::hasColumn('leaves', $key) && !empty($value)) {

                    $query->where($key, $value);

                }

            }

        if (!empty($where['start_time']) && !empty($where['end_time'])) {

            $query->whereBetween('start_time', [$where['start_time'], $where['end_time']]);

        }

        $result = $query->paginate($this->pagesize);

select * from `leaves` where `user_id` = '1'
---
    public function scopegetLeavesByUserId($query)
    {
        $result = $query->where('user_id', $this->user_id);