app/Tag.php

    public static function getLeavesTagIdByTagId($tag_id)
    {
        $result = self::where('id',$tag_id)->get();
---
select * from `tags` where `id` = '7'