app/Type.php

    public static function getLeavesTypeIdByTypeId($type_id)
    {
        $result = self::where('id',$type_id)->get();
---
select * from `types` where `id` is null