app/Type.php

    public function search($where = [])
    {
        $query = $this->OrderedBy();

        $columns = array_map('strtolower', Schema::getColumnListing('types'));

        foreach ($where as $key => $value) {

            if (in_array($key, $columns) && isset($value)) {

                if ($key == 'name') {

                    $query->where('name', 'LIKE', '%'. $value .'%');

                }  else {

                    $query->where($key, $value);

                }

            }

        }

        $result = $query->paginate($this->pagesize);
---
select * from `types` order by `id` desc limit 25 offset 0
select count(*) as aggregate from `types`