app/Http/Controllers/LeaveTypeController.php

insert into `types` (`name`, `exception`, `reset_time`, `hours`, `prove`, `start_time`, `end_time`, `reason`, `available`, `updated_at`, `created_at`) values ('dfdf', 'normal', 'none', '1', '1', '2017-09-09', '2017-09-16', '0', '0', '2017-09-04 12:37:43', '2017-09-04 12:37:43')
---
     public function postInsert(LeaveTypeRequest $request)
     {

        $input = $request->input('leave_type');

        $input['reason']  = empty($input['reason']) || $input['reason'] != 'on' ? 0 : 1 ;
        $input['prove']  = empty($input['prove']) || $input['prove'] != 'on' ? 0 : 1 ;
        $input['available']  = empty($input['available']) || $input['available'] != 'on' ? 0 : 1 ;

        //儲存資料
        $model = new Type();
        $model->fill($input);

        if($model->saveOriginalOnly()) {

select * from `types` where `types`.`id` = '61' limit 1
---
    private function loadModel($id)
    {
        $model = Type::find($id);