app/Http/Controllers/LeavesController.php

    private function loadModel($id)
    {
        $model = Leave::find($id);
---
select * from `leaves` where `leaves`.`id` = '3' limit 1