app/Http/Controllers/LeavesController.php

select * from `leaves` where `leaves`.`id` = '1' limit 1
---
    private function loadModel($id)
    {
        $model = Leave::find($id);